[
  {
    "id": 1,
    "title": "CQC Inspection Framework: 2025 Recap and 2026 Projections",
    "excerpt": "Everything you need to know about the CQC's transformation year, what's landing in 2026, and how to stop panicking about it all. A comprehensive guide to the Single Assessment Framework, 34 Quality Statements, and what care providers need to do now.",
    "category": "TRAINING",
    "date": "2025-12-01",
    "image": "assets/img/stock_photos/06_BLOG_POSTS/blog_post01.webp",
    "url": "cqc-inspection-framework-2025-2026.html",
    "categoryName": "CQC Compliance",
    "readTime": "12 min read"
  },
  {
    "id": 2,
    "title": "Maidstone Training Provider Wins National Award in First Year of Operation",
    "excerpt": "Continuity of Care Services, barely a year old, has been recognised as Centre of the Year 2021 by Advantage Accreditation - the independent body that accredits health and social care training across the UK.",
    "content": "<p><strong>Continuity of Care Services Named Centre of the Year 2021 by Advantage Accreditation</strong></p>\n<p><em>We're still processing this one.</em><br>Continuity of Care Services, founded just over a year ago, was recognised as Centre of the Year 2021 by Advantage Accreditation, an independent organisation that certifies health and social care training across the UK. Given that we launched in 2020 during a pandemic, this achievement feels almost surreal.</p>\n\n<h2>About Continuity of Care Services</h2>\n<p>Established in 2020, Continuity of Care Services provides accredited health and social care training from our base in Maidstone, Kent. We specialise in Emergency First Aid, Care Certificate programmes, medication management, and specialist clinical training. Our courses are mapped to CQC requirements and recognised nationally.</p>\n\n<p>We're the sister company of <a href=\"https://www.continuitycareservices.co.uk\">Continuity of Care Services</a>, a CQC-rated domiciliary care provider, which means we understand the sector from both the training and care provider sides.</p>\n\n<h2>About the Award</h2>\n<p>Advantage Accreditation presents the Centre of the Year Award to training centres that demonstrate excellence in accredited training delivery, trainer competency, learner outcomes, and adherence to national frameworks and standards.</p>\n\n<p>Advantage Accreditation grants this recognition only after a thorough review. They evaluate training centres against standards such as the National Occupational Standards, Skills for Care frameworks, CQC requirements, and other criteria, confirming that our training exceeds basic Powerpoint presentations.</p>\n\n<h2>What This Actually Means</h2>\n<p>The Centre of the Year award reflects their assessment of our training delivery, materials, trainer expertise, learner achievements, and commitment to preparing care workers. They recognised our excellence in these areas.</p>\n\n<p>This award genuinely honours our trainers, especially Jen Boorman, a vital part of our team from the start. With hands-on experience - handling catheter changes at 3 am, managing medication rounds, and navigating complex dementia behaviours- she emphasises practical, real-life skills over mere theory.</p>\n\n<h2>The Pandemic Context</h2>\n<p>When COVID hit and care homes faced a crisis, we stayed operational. We adjusted by delivering courses online whenever feasible, offering on-site training with full PPE when needed, and supporting Kent's care sector through the most difficult periods.</p>\n\n<p>In 2021, a tough year for training, we conducted courses while wearing full hazmat suits, taught CPR with face shields, and maintained social distancing. Some groups cancelled due to outbreaks, yet the demand for care worker training remained since the CQC's standards did not change, and care homes still needed qualified staff.</p>\n\n<p>Despite these challenges, we kept providing training. Winning this award this year validates that our resilient approach was the right strategy.</p>\n\n<h2>What We're Building</h2>\n<p>We're not interested in being the biggest training academy in Kent. We're interested in being the best. Our approach?</p>\n<ul>\n\t<li>Small groups enable trainers to engage directly with participants and focus on real-world scenarios rather than hypothetical textbook cases.</li>\n\t<li>Our trainers are seasoned experts who offer practical insights.</li>\n\t<li>The training is adaptable and structured to ensure it doesn't interfere with care services.</li>\n\t<li>Furthermore, staff receive certification upon sign-off, enabling them to start work immediately.</li>\n</ul>\n\n<h2>What's Next</h2>\n<p>This award isn't a finish line. It's validation that we're on the right track.</p>\n\n<p>We're expanding our course offerings in 2022. We're bringing on more experienced trainers. We're investing in better facilities at The Maidstone Studios. We're continuing to support Kent's care sector with training that prepares people for the realities of care work.</p>\n\n<p><strong>Contact:</strong><br>\nContinuity of Care Services<br>\nThe Maidstone Studios, New Cut Road<br>\nMaidstone, Kent ME14 5NZ<br>\n01622 587343<br>\ncontinuitytrainingacademy.co.uk</p>",
    "category": "AWARDS",
    "date": "2021-12-15",
    "image": "assets/img/stock_photos/06_BLOG_POSTS/blog_post02.webp",
    "url": "maidstone-training-provider-wins-national-award.html",
    "categoryName": "Awards & Recognition",
    "readTime": "8 min read"
  },
  {
    "id": 3,
    "title": "First Aid Certification: What You Need to Know",
    "excerpt": "Essential first aid certification training that equips your team with life-saving skills. Our comprehensive programmes cover CPR, AED training, and emergency response protocols to ensure your staff are prepared for any situation.",
    "category": "TRAINING",
    "date": "2025-01-28",
    "image": "assets/img/stock_photos/05_COURSE_THUMBNAILS/emergency_first_aid06.webp",
    "url": "news.html",
    "categoryName": "First Aid & Emergency",
    "readTime": "6 min read"
  },
  {
    "id": 4,
    "title": "Understanding Medication Administration Protocols",
    "excerpt": "Stay compliant with the latest medication administration regulations through our expert-led training programmes. We help care providers maintain the highest standards of medication safety and documentation.",
    "category": "TRAINING",
    "date": "2025-01-20",
    "image": "assets/img/stock_photos/06_BLOG_POSTS/blog_post01.webp",
    "url": "news.html",
    "categoryName": "Medication & Clinical Skills",
    "readTime": "5 min read"
  },
  {
    "id": 5,
    "title": "Moving and Handling: Reducing Workplace Injuries",
    "excerpt": "Learn the latest techniques in safe moving and handling to protect both your staff and service users. Our training programmes focus on practical skills and risk assessment.",
    "category": "TRAINING",
    "date": "2025-01-15",
    "image": "assets/img/stock_photos/06_BLOG_POSTS/blog_post02.webp",
    "url": "news.html",
    "categoryName": "Manual Handling & Safety",
    "readTime": "4 min read"
  }
]

