[
  {
    "name": "Victoria Walker",
    "slug": "victoria-walker",
    "role": "Company Director",
    "type": "director",
    "experience": "Est. 2020",
    "image": "assets/img/instructors/victoria_walker",
    "teaser": "I have been in the Health and Social Care Sector since 2008 where I was a PA (Personal Assistant) for a disabled husband and wife. From working with them it became apparent that training that was unique to their needs was instrumental in giving a better quality of support...",
    "bio": "<p>I have been in the Health and Social Care Sector since 2008 where I was a PA (Personal Assistant) for a disabled husband and wife. From working with them it became apparent that training that was unique to their needs was instrumental in giving a better quality of support; therefore, I do believe training is one of the most important things any care company can invest in.</p><p>I have known Jennifer Boorman since the first day of owning a care company and have always enjoyed her knowledge and enthusiasm when delivering training to our staff, with nothing ever being too much trouble to help us when we needed it or adapting our training package to suit the needs of our business.</p><p>Therefore, during the recent pandemic, while a lot of care companies looked online to give their teams training, we collaborated with Jennifer to create Continuity of Care Services.</p><p>To compliment our care training, I felt it important to also look at delivering clinical training at an affordable cost to companies as this was a big issue while I was working in the care sector. We have therefore had a Registered Nurse delivering clinical training packages.</p><p>Between the management team, we don't intend to stop at delivering the above. We will continue to evolve the company to be able to deliver apprenticeships starting in the care industry and venturing out to other industries.</p>",
    "specialisations": [
      "Health & Social Care Training",
      "Care Company Training Needs",
      "Clinical Training at Affordable Costs",
      "Training Package Development",
      "Apprenticeship Development"
    ]
  },
  {
    "name": "Chloe Roberts",
    "slug": "chloe-roberts",
    "role": "Company Director",
    "type": "director",
    "experience": "Est. 2020",
    "image": "assets/img/instructors/chloe_roberts",
    "teaser": "I have been working in the Health Care Sector since 2015. From when I left school, training played a big part in all my roles. I have carried out my apprenticeships from Level 2 all the way to Level 5...",
    "bio": "<p>I have been working in the Health Care Sector since 2015.</p><p>From when I left school, training played a big part in all my roles. I have carried out my apprenticeships from Level 2 all the way to Level 5. All of my roles have been in the Health Care Sector either as part of a GP Practice or working for a Domiciliary Care Provider.</p><p>For the last 3.5 years I have been working closely with our Lead Trainer, Jennifer to build a Training Department for an organisation and to give others the opportunity to enhance their knowledge undertaking their Health and Social Care qualifications and working then towards their Care Certificate.</p><p>All of us at Continuity of Care Services love watching individuals achieve their career goals through our training programme. Whether that be becoming specialists in certain areas of Health Care, becoming a trainer or even going into Management roles.</p><p>Having worked my way up through the apprenticeship programme, having a training organisation that you <strong>know, and trust</strong> is so important and one of our core values.</p>",
    "specialisations": [
      "Health & Social Care Apprenticeships (Level 2-5)",
      "Training Department Development",
      "Care Certificate Training",
      "Career Development & Progression",
      "GP Practice & Domiciliary Care Training"
    ]
  },
  {
    "name": "Adele Smith",
    "slug": "adele-smith",
    "role": "Company Trainer",
    "type": "trainer",
    "experience": "7+ Years Experience",
    "image": "assets/img/instructors/adele_smith",
    "teaser": "Hi there! My name is Adele, and I started working for Continuity Care Services in August as a company trainer for Continuity of Care Services. I studied for my PTLLS in 2014 and started working in the care industry as a freelance trainer in 2017...",
    "bio": "<p>Hi there! My name is Adele, and I started working for Continuity Care Services in August as a company trainer for Continuity of Care Services. I studied for my PTLLS in 2014 and started working in the care industry as a freelance trainer in 2017, working in and around Kent empowering individuals to enhance their skills. Before CCS, I was based in a residential and nursing setting supporting staff and providing in-house training, scheduling training sessions, identifying company training needs, compliance and audits, as well as care of the elderly in the private health sector.</p><p>I continually update my own knowledge and skills through CPD and other training courses to ensure I am up to date, ensuring compliance with regulatory requirements, and I am a member of the Association of Healthcare Trainers.</p>",
    "specialisations": [
      "Staff Training and Development",
      "Training Needs Assessment",
      "Compliance and Audits",
      "Care of the Elderly",
      "Regulatory Requirements"
    ]
  },
  {
    "name": "Sharon Cudlip",
    "slug": "sharon-cudlip",
    "role": "Healthcare Educator",
    "type": "trainer",
    "experience": "40+ Years Experience",
    "image": "assets/img/instructors/sharon_cudlip",
    "teaser": "Sharon brings over 40 years of experience in health and social care as a Registered Adult Nurse and over 28 years of teaching and mentoring. She is an intuitive and reflective educator with a strong track record...",
    "bio": "<p>Sharon brings over 40 years of experience in health and social care as a Registered Adult Nurse and over 28 years of teaching and mentoring. She is an intuitive and reflective educator with a strong track record of delivering expert support and development to healthcare and social care professionals and non-healthcare participants during workshops and training sessions. She lives with the gift and frustration of dyslexia.</p><p>She enjoys facilitating by embracing her dyslexia as a friend rather than a foe. Having learnt to embrace the adventures and spirit of her learning and teaching style, she is able to communicate effectively to participants during the various sessions taught and facilitated, encouraging them to ignite and engage their spirit of inquiry and professional curiosity.</p><p>As an experienced facilitator, she delivers on a variety of subject areas and is also a health and social care educator. She brings a wide range of experience to each face-to-face session.</p><p>She strives to create impactful training and learning experiences and ensures the learning environment is one built upon trust, hope, sense of worth, and competence.</p>",
    "specialisations": [
      "Health & Social Care Education",
      "Teaching and Mentoring",
      "Workshop Facilitation",
      "Professional Development",
      "Inclusive Learning Environments"
    ]
  },
  {
    "name": "Jennifer Boorman",
    "slug": "jennifer-boorman",
    "role": "Lead Trainer",
    "type": "trainer",
    "experience": "30+ Years Experience",
    "image": "assets/img/instructors/jen_boorman",
    "teaser": "I am a professionally qualified healthcare professional, teacher and trainer with a comprehensive healthcare, teaching and training background. My experience and knowledge has been gained in demanding and challenging work environments over almost 30 years...",
    "bio": "<p>I am a professionally qualified healthcare professional, teacher and trainer with a comprehensive healthcare, teaching and training background. My experience and knowledge has been gained in demanding and challenging work environments over almost 30 years. I love and enjoy the challenges of facilitating group and individual training sessions, I believe I have the aptitude, approach and attitude to encourage learners to succeed. The more encouragement I can deliver to learners the more satisfaction learners will have in themselves and trainers have a sense of being part of their success.</p>",
    "specialisations": [
      "Group and Individual Training Facilitation",
      "Healthcare Training and Development",
      "Training Delivery and Learner Support",
      "Professional Development and Training",
      "Healthcare Education"
    ]
  }
]

